const messages = [
  "كل ما فقدته… يعود بشكل أجمل، أو يُعوضك الله بما هو خير.",
  "الله ما ينسى، حتى الهمسات اللي ما قدرت تحكيها.",
  "الله يفرّج همّك ويشرح صدرك.",
  "اطمئن، الخير جاي، والأيام الحلوة بانتظارك.",
  "كل شي بيتصلح مع الوقت، وما في شي مستحيل.",
  "توكّل على الله، هو أرحم وأعلم.",
  "الأيام القادمة أجمل، ربّي ما بينسى حد.",
  "ابتسم، الله كاتب لك الخير قدّام.",
  "كل شي بيهون مع الدعاء والصبر.",
  "ريح بالك، الله كريم وما بينسى حد.",
  "ثِق أن ربنا ما ينسى حد تعب.",
  "الله معك بكل خطوة، ما تخاف."
];


function getRandomMessage() {
  const index = Math.floor(Math.random() * messages.length);
  return messages[index];
}

document.getElementById("message").innerText = getRandomMessage();
