const messages = [
"قال الله: ﴿إني قريب﴾… لا تخاف، هو معك دومًا.",
  "وفي دعائك، خبّئ اسمك واسم من تحب، فالله لا ينسى.",
  "كل لحظة صبر تقرّبك من شيء جميل، فقط اثبت.",
  "الليلة… القمر شاهد، والنية طاهرة، والرجاء بالله لا يخيب.",
  "ما خاب من قال: يا رب.",
  "تذكّر: إنّ مع العسر يُسرا.",
  "بينك وبين الفرج، دعوة صادقة وقلب لا ييأس.",
  "أؤمن بك، حتى وإن نسيت ان تؤمن بنفسك.",
  "كلما ضاقت، ابتسم… الله يُدبّر بلُطف.",
  "وحده الله يعلم كم مرة بكيت بصمت، وكم مرة نجاك دون أن تدري.",
  "يا من تحمل النور في قلبك، لا تدع العتمة تخدعك.",
  "كل الأحلام المؤجلة، ستأتي في وقتها الأجمل… فقط انتظر.",
  "كل يوم جديد هو فرصة لبداية مختلفة، لا تخاف منها.",
  "يا رب، اجعل له من نورك دربًا لا يضل.",
  "نصيبك سيأتي، ربما متأخر… لكنه سيُدهشك.",
  "في كل ١١:١١، تذكر… انني دائما أدعو أن تكون بخير.",
  "الله ما ينسى، حتى الهمسات اللي ما قدرت تحكيها.",
  "وإذا أتاك الفرح، لا تنسي أن تحمد طويلًا على الصبر.",
  "الله يعلم بكل شيء تخفيه القلوب، فاصبر، فإن الفرج قريب.",
  "وفي لحظةٍ ما، ستدرك أن كل تأخير كان لحكمة أجمل.",
  "ما دام الله معك، فمن عليك؟",
  "كل شيء جميل يبدأ بنيّة طيبة.",
  "قد لا ترى النور الآن، لكنك تقترب منه أكثر مما تظن.",
  "الطمأنينة لا تأتي من الخارج، بل من يقينك بالله.",
  "ربما الأيام تُخبئ لك ما دعوت به طويلاً.",
  "ألمع دائما و تمامًا كما تفعل النجوم.",
  "لا تيأس، فقد تُزهر غدًا زهرةٌ زرعتها منذ سنوات.",
  " هناك أشياء لا تُقال، لكن تذكر ان الله يفهمك وهو معك. ",
  "في كل 11:11، هناك أمنية تنتظر التحقق.",
  "الصبر ليس فقط انتظار، بل ثقة بأن كل شيء سيأتي في وقته.",
  "الأحلام لا تموت، هي فقط تنتظر من يوقظها.",
  "كل بداية بسيطة، يُمكن أن تُصبح شيئًا عظيمًا.",
  "إن الله لا يُضيع من أحسن نيّته.",
  "دع قلبك يتنفس، ولو بكلمة واحدة صادقة.",
  "كل ما فقدته… يعود بشكل أجمل، أو يُعوضك الله بما هو خير."

  
];


function getRandomMessage() {
  const index = Math.floor(Math.random() * messages.length);
  return messages[index];
}

document.getElementById("message").innerText = getRandomMessage();
